In [26]:
import numpy as np
import platform as pl
import pandas as pd
print(np.__version__)
print(pl.python_version())

1.14.0
3.6.4

In [140]:
# import csv from github and show table
df = pd.read_csv('https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv')
df

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [141]:
# show colums
list(df)

['Name', 'People', 'Area', 'BIP', 'Currency']

In [142]:
# show rows
list(df.index)

[0, 1, 2, 3, 4]

In [143]:
# show statistical basic infos
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
People,5.0,102786293.6,6.759970e+07,36503097.0,60501718.0,82521653.0,126045000.0,208360000.0
Area,5.0,3907399.6,4.904957e+06,301338.0,357385.0,377835.0,8515770.0,9984670.0
BIP,5.0,2716.2,1.457861e+03,1529.0,1798.0,1850.0,3466.0,4938.0

In [144]:
# show last 4 rows of dataframe
df[1:5]

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [145]:
# Show all the row of countries who have the EURO
df[df.Currency == 'EUR']

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [146]:
#Show only Name and Currency in a new data frame
new = df[['Name', 'Currency']].copy()
new

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [147]:
# Show only the rows/countries that have more than 2000 BIP
df[df.BIP > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [148]:
# Select all countries where with inhabitants between 50 and 150 Mio
df[(df.People >= 50000000) & (df.People <= 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [149]:
# Change BIP to Bip
df = df.rename(columns={'BIP': 'Bip'})
df

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [150]:
# Calculate the Bip sum
Bip = df['Bip'].sum()
Bip

13581

In [151]:
# Calculate the average people of all countries
df["People"].mean()

102786293.6

In [152]:
# Sort by name alphabetically
df.sort_values('Name')

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [153]:
# Create a new data frame from the original where the area is changed as follows: 
#all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!
new2 = df.copy()
big = new2.Area > 1000000
small = new2.Area <= 1000000
new2.loc[big, 'Area'] = 'BIG'
new2.loc[small, 'Area'] = 'SMALL'
new2

       Name     People   Area   Bip Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL